<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#–í—Å–µ-–∑–∞–¥–∞–Ω–∏—è-–Ω—É–∂–Ω–æ-–≤—ã–ø–æ–ª–Ω–∏—Ç—å-—Ç–æ–ª—å–∫–æ-—Å-–ø–æ–º–æ—â—å—é-sql" data-toc-modified-id="–í—Å–µ-–∑–∞–¥–∞–Ω–∏—è-–Ω—É–∂–Ω–æ-–≤—ã–ø–æ–ª–Ω–∏—Ç—å-—Ç–æ–ª—å–∫–æ-—Å-–ø–æ–º–æ—â—å—é-sql-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>–í—Å–µ –∑–∞–¥–∞–Ω–∏—è –Ω—É–∂–Ω–æ –≤—ã–ø–æ–ª–Ω–∏—Ç—å —Ç–æ–ª—å–∫–æ —Å –ø–æ–º–æ—â—å—é sql</a></span></li></ul></div>

In [1]:
import sqlite3
import pandas as pd

In [2]:
con = sqlite3.connect(':memory:')

https://www.cs.toronto.edu/~delve/data/boston/bostonDetail.html

In [6]:
data = pd.read_csv('./csv_for_sql/boston.csv')
data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [7]:
data.to_sql('boston', con, index=False, if_exists='replace')

In [8]:
pd.read_sql(
    '''
    SELECT count(*) FROM boston
    ''',
    con,
)

   count(*)
0       506

In [26]:
tasks = 0

### –í—Å–µ –∑–∞–¥–∞–Ω–∏—è –Ω—É–∂–Ω–æ –≤—ã–ø–æ–ª–Ω–∏—Ç—å —Ç–æ–ª—å–∫–æ —Å –ø–æ–º–æ—â—å—é sql

1. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –ø—É—Å—Ç—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –ø–æ –∫–æ–ª–æ–Ω–∫–∞–º CRIM, ZN, INDUS, CHAS, NOX (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏, –∫–æ–ª-–≤–æ –ø—É—Å—Ç—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π)

In [27]:
tasks+=1
pd.read_sql(
    '''
    select 
        'CRIM' as Column, sum(case when CRIM is null then 1 else 0 end) as empty_cnt
    FROM boston    
    union all
    select
        'ZN' as Column, sum(case when ZN is null then 1 else 0 end)as empty_cnt
    FROM boston    
    union all
    select
        'INDUS' as Column, sum(case when  INDUS is null then 1 else 0 end) as empty_cnt
    FROM boston
    union all
    select
        'CHAS' as Column, sum(case when CHAS is null then 1 else 0 end) as empty_cnt
    FROM boston
    union all
    select
        'NOX' as Column, sum(case when NOX is null then 1 else 0 end) as empty_cnt
    FROM boston
    ''',
    con,
)

  Column  empty_cnt
0   CRIM          0
1     ZN          0
2  INDUS          0
3   CHAS          0
4    NOX          0

2. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –ø–æ –∫–æ–ª–æ–Ω–æ–∫–∞–º CRIM, ZN, INDUS, CHAS, NOX (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏, –∫–æ–ª-–≤–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π)

In [28]:
tasks+=1
pd.read_sql(
    '''
        SELECT 
           'CRIM' as Column, count(distinct(CRIM)) as unique_cnt
        FROM boston    
        union all
        select   
           'ZN' as Column, count(distinct(ZN)) as unique_cnt
        FROM boston    
        union all
        select   
           'INDUS' as Column,  count(distinct(INDUS)) as unique_cnt
        FROM boston    
        union all
        select   
           'CHAS' as Column,  count(distinct(CHAS)) as unique_cnt
        FROM boston    
        union all
        select   
           'NOX' as Column,  count(distinct(NOX)) as unique_cnt
        FROM boston
    ''',
    con,
)

  Column  unique_cnt
0   CRIM         504
1     ZN          26
2  INDUS          76
3   CHAS           2
4    NOX          81

3. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–æ–Ω–∫–∏, —É –∫–æ—Ç–æ—Ä—ã—Ö –º–µ–¥–∏–∞–Ω–∞ —Ä–∞–≤–Ω–∞ –º–∏–Ω–∏–º–∞–ª—å–Ω–æ–º—É –∑–Ω–∞—á–µ–Ω–∏—é (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏) –≤—ã–±–∏—Ä–∞—è –∏–∑ CRIM, ZN, INDUS, CHAS, NOX.
–ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ –¥–∞–Ω–Ω—ã–º –≤ —ç—Ç–∏—Ö –∫–æ–ª–æ–Ω–∫–∞—Ö

In [29]:
tasks+=1
pd.read_sql(
    '''
    with medians as (
        SELECT 'CRIM' as COLUMN_NAME, AVG(CRIM) as median_value
        FROM (
                SELECT CRIM
                FROM boston
                ORDER BY CRIM
                LIMIT 2 - (SELECT COUNT(*) FROM boston) % 2
                OFFSET (SELECT (COUNT(*) - 1) / 2 FROM boston))
        UNION ALL
        SELECT 'ZN' as COLUMN_NAME, AVG(ZN) as median_value
        FROM (
                SELECT ZN
                FROM boston
                ORDER BY ZN
                LIMIT 2 - (SELECT COUNT(*) FROM boston) % 2
                OFFSET (SELECT (COUNT(*) - 1) / 2 FROM boston))
        UNION ALL
        SELECT 'INDUS' as COLUMN_NAME, AVG(INDUS) as median_value
        FROM (
                SELECT INDUS
                FROM boston
                ORDER BY INDUS
                LIMIT 2 - (SELECT COUNT(*) FROM boston) % 2
                OFFSET (SELECT (COUNT(*) - 1) / 2 FROM boston))
        UNION ALL
        SELECT 'CHAS' as COLUMN_NAME, AVG(CHAS) as median_value
        FROM (
                SELECT CHAS
                FROM boston
                ORDER BY CHAS
                LIMIT 2 - (SELECT COUNT(*) FROM boston) % 2
                OFFSET (SELECT (COUNT(*) - 1) / 2 FROM boston))
        UNION ALL
        SELECT 'NOX' as COLUMN_NAME, AVG(NOX) as median_value
        FROM (
                SELECT NOX
                FROM boston
                ORDER BY NOX
                LIMIT 2 - (SELECT COUNT(*) FROM boston) % 2
                OFFSET (SELECT (COUNT(*) - 1) / 2 FROM boston)))
    , mins as(
        SELECT distinct
               'CRIM' as COLUMN_NAME
                , min(CRIM) OVER() as min_value
        FROM boston b
        UNION ALL
        SELECT distinct
               'ZN' as COLUMN_NAME
                , min(ZN) OVER() as min_value
        FROM boston b
        UNION ALL
        SELECT distinct
               'INDUS' as COLUMN_NAME                
                , min(INDUS) OVER() as min_value
        FROM boston b
        UNION ALL
        SELECT distinct
               'CHAS' as COLUMN_NAME
                , min(CHAS) OVER() as min_value
        FROM boston b
        UNION ALL
        SELECT distinct
               'NOX' as COLUMN_NAME
                , min(NOX) OVER() as min_value
        FROM boston b 
    )
    
    SELECT distinct
           mins.COLUMN_NAME
            , mins.min_value
            , medians.median_value
    FROM mins  
        join medians on medians.COLUMN_NAME=mins.COLUMN_NAME
    where min_value=median_value
        
    ''',
    con,
)

  COLUMN_NAME  min_value  median_value
0          ZN        0.0           0.0
1        CHAS        0.0           0.0

–í—ã–≤–æ–¥—ã: 

–ù–µ –º–µ–Ω–µ–µ —á–µ–º –≤ –ø–æ–ª–æ–≤–∏–Ω–µ —Ä–∞—Å—Å–º–∞—Ç—Ä–∏–≤–∞–µ–º—ã—Ö –∫–µ–π—Å–æ–≤ –¥–æ–ª—è –∑–µ–º–µ–ª—å –ø–æ–¥ –∂–∏–ª—É—é –∑–∞—Å—Ç—Ä–æ–π–∫—É –Ω–µ –∑–æ–Ω–∏—Ä–æ–≤–∞–Ω–∞ –ø–æ–¥ —É—á–∞—Å—Ç–∫–∏ –ø–ª–æ—â–∞–¥—å—é –±–æ–ª–µ–µ 25 000 –∫–≤. —Ñ—É—Ç–æ–≤.

–ù–µ –º–µ–Ω–µ–µ —á–µ–º –≤ –ø–æ–ª–æ–≤–∏–Ω–µ —Ä–∞—Å—Å–º–∞—Ç—Ä–∏–≤–∞–µ–º—ã—Ö –∫–µ–π—Å–æ–≤ —É—á–∞—Å—Ç–∫–∏ –Ω–µ –≥—Ä–∞–Ω–∏—á–∞—Ç —Å —Ä–µ–∫–æ–π.

4. –í—ã–≤–µ–¥–∏—Ç–µ —Ä–∞–∑–Ω–∏—Ü—É –º–µ–∂–¥—É —Å—Ä–µ–¥–Ω–µ–º –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ–º –∫–æ–º–Ω–∞—Ç(RM) –≤ –¥–æ–º–∞—Ö —Å —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π —Å—Ç–æ–∏–º–æ—Å—Ç—å—é(MEDV) –∏ 25 —Å–∞–º—ã–º–∏ –¥–µ—à–µ–≤—ã–º–∏ –¥–æ–º–∞–º–∏. 
–ê–Ω–∞–ª–æ–≥–∏—á–Ω–æ –ø–æ 50, 100, 200, 300 —Å–∞–º—ã–º–∏ –¥–µ—à–µ–≤—ã–º–∏ –¥–æ–º–∞–º–∏. (–∫–æ–ª-–≤–æ –¥–æ–º–æ–≤(25,50,100,200,300), —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ –Ω–∏—Ö, —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ —Å–∞–º—ã—Ö –¥–æ—Ä–æ–≥–∏—Ö, —Ä–∞–∑–Ω–∏—Ü–∞).
–ù–∞–ø–∏—à–∏—Ç–µ –≤–ª–∏—è–µ—Ç –ª–∏ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –Ω–∞ —Å—Ç–æ–∏–º–æ—Å—Ç—å –∏ –∫–∞–∫ —Å–∏–ª—å–Ω–æ.

In [30]:
tasks+=1
pd.read_sql(
    '''
     with tmp as (
         select MEDV
                ,RM
                , avg(RM) FILTER(where MEDV in (select MAX(MEDV) FROM boston)) over() as RM_AvgMax 
                , row_number() over(ORDER BY MEDV asc) as RowNumber
         FROM boston )
    , counts as ( 
         select column1 as FirstRowCount 
         FROM (VALUES (25), (50), (100), (200), (300))
         )
     
     select t.* 
           , RM_AvgMax - RM_Avg as Difference
     from (
           select distinct FirstRowCount
                  , avg(RM) over(partition by FirstRowCount) as RM_Avg
                  , RM_AvgMax
          from counts 
               join tmp on tmp.RowNumber<=counts.FirstRowCount) t
    ''',
    con,
)

   FirstRowCount    RM_Avg  RM_AvgMax  Difference
0             25  5.747840      7.484    1.736160
1             50  5.753240      7.484    1.730760
2            100  5.887120      7.484    1.596880
3            200  5.911705      7.484    1.572295
4            300  5.972227      7.484    1.511773

–° —É–≤–µ–ª–∏—á–µ–Ω–∏–µ–º –∫–æ–ª–∏—á–µ—Å—Ç–≤–∞ –∫–æ–º–Ω–∞—Ç –Ω–∞–±–ª—é–¥–∞–µ—Å—Ç—è —É–≤–µ–ª–∏—á–µ–Ω–∏–µ —Å—Ç–æ–∏–º–æ—Å—Ç–∏ –¥–æ–º–∞.

5. –í—ã–≤–µ–¥–∏—Ç–µ —Ä–∞–Ω–≥–∏ –∑–Ω–∞—á–µ–Ω–∏–π –∫–æ–ª–æ–Ω–∫–∏ LSTAT(–ø—Ä–æ—Ü–µ–Ω—Ç –Ω–∞—Å–µ–ª–µ–Ω–∏—è —Å –±–æ–ª–µ–µ –Ω–∏–∑–∫–∏–º —Å—Ç–∞—Ç—É—Å–æ–º) –≤ –¥–æ–º–∞—Ö —Å —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π —Å—Ç–æ–∏–º–æ—Å—Ç—å—é (–∑–Ω–∞—á–µ–Ω–∏–µ LSTAT, —Å—Ç–æ–∏–º–æ—Å—Ç—å, —Ä–∞–Ω–≥) —Å—Ä–µ–¥–∏ –≤—Å–µ—Ö –∑–Ω–∞—á–µ–Ω–∏–π LSTAT. –ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ —ç—Ç–∏–º –¥–∞–Ω–Ω—ã–º.

In [38]:
tasks+=1
pd.read_sql(
    '''
    select * from(
        select LSTAT, MEDV
            , rank() over (ORDER BY LSTAT asc) as Rank
        FROM boston)
    where MEDV in (select MAX(MEDV) FROM boston)
    ''',
    con,
)

    LSTAT  MEDV  Rank
0    1.73  50.0     1
1    1.92  50.0     2
2    2.88  50.0     6
3    2.96  50.0     8
4    2.97  50.0     9
5    3.16  50.0    15
6    3.26  50.0    17
7    3.32  50.0    18
8    3.70  50.0    26
9    3.73  50.0    27
10   4.45  50.0    41
11   4.63  50.0    50
12   5.12  50.0    67
13   7.44  50.0   141
14   8.88  50.0   181
15   9.53  50.0   203

–í—ã–≤–æ–¥: –†–∞–∑–±—Ä–æ—Å –ø–æ–ª–æ–∂–µ–Ω–∏–π —ç—Ç–∏—Ö –¥–æ–º–æ–≤ –≤ —Ä–µ–π—Ç–∏–Ω–≥–µ –¥–æ–≤–æ–ª—å–Ω–æ –±–æ–ª—å—à–æ–π. –ó–Ω–∞—á–∏—Ç, –ø–æ–∫–∞–∑–∞—Ç–µ–ª–∏ "–ø—Ä–æ—Ü–µ–Ω—Ç –Ω–∞—Å–µ–ª–µ–Ω–∏—è —Å –±–æ–ª–µ–µ –Ω–∏–∑–∫–∏–º —Å—Ç–∞—Ç—É—Å–æ–º" –∏ "—Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–∞" —Å–ª–∞–±–æ —Å–≤—è–∑–∞–Ω—ã –º–µ–∂–¥—É —Å–æ–±–æ–π. 

–° —Ç–æ—á–∫–∏ –∑—Ä–µ–Ω–∏—è –ø–æ—Ç–µ–Ω—Ü–∏–∞–ª—å–Ω–æ–≥–æ –ø–æ–∫—É–ø–∞—Ç–µ–ª—è –≤—ã—Å–æ–∫–∞—è –¥–æ–º–∞ —Å—Ç–æ–∏–º–æ—Å—Ç—å –Ω–µ –≥–∞—Ä–∞–Ω—Ç–∏—Ä—É–µ—Ç –Ω–∏–∑–∫–æ–µ –∑–Ω–∞—á–µ–Ω–∏–µ –ø—Ä–æ—Ü–µ–Ω—Ç–∞ –Ω–∞—Å–µ–ª–µ–Ω–∏—è —Å –±–æ–ª–µ–µ –Ω–∏–∑–∫–∏–º —Å—Ç–∞—Ç—É—Å–æ–º –≤ –¥–æ–º–µ.

6. –í—ã–≤–µ–¥–∏—Ç–µ —Å—Ä–µ–¥–Ω—é—é —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤ –≥—Ä–∞–Ω–∏—á–∞—â–∏—Ö —Å —Ä–µ–∫–æ–π(CHAS) –∏ –Ω–µ—Ç (–≥—Ä–∞–Ω–∏—á–∏—Ç/–Ω–µ –≥—Ä–∞–Ω–∏—á–∏—Ç, —Å—Ç–æ–∏–º–æ—Å—Ç—å)

In [32]:
tasks+=1
pd.read_sql(
    '''
    SELECT CHAS, avg(MEDV) 
    FROM boston
    group by CHAS
    ''',
    con,
)

   CHAS  avg(MEDV)
0   0.0  22.093843
1   1.0  28.440000

7. –í—ã–≤–µ–¥–∏—Ç–µ –≤—Å–µ –∫–æ–ª–æ–Ω–∫–∏, —É –∫–æ—Ç–æ—Ä—ã—Ö —Å—Ä–µ–¥–Ω–µ–µ –∑–Ω–∞—á–µ–Ω–∏–µ –≤—ã—à–µ, –∫–æ–≥–¥–∞ –¥–æ–º –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏) –≤—ã–±–∏—Ä–∞—è –∏–∑ CRIM, ZN, INDUS, CHAS, NOX. –ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ —ç—Ç–∏–º –¥–∞–Ω–Ω—ã–º.

In [36]:
tasks+=1
pd.read_sql(
    '''
    with tmp as (
                SELECT distinct 'CRIM' as column_name
                        , avg(CRIM) FILTER(where CHAS = 1.0) over()  avgCHAS_1
                        , avg(CRIM) FILTER(where CHAS = 0.0) over()  avgCHAS_0 
                FROM boston
                
                UNION ALL
                SELECT distinct 'ZN' as column_name
                        , avg(ZN) FILTER(where CHAS = 1.0) over()  avgCHAS_1
                        , avg(ZN) FILTER(where CHAS = 0.0) over()  avgCHAS_0 
                FROM boston
                
                UNION ALL
                SELECT distinct 'INDUS' as column_name
                        , avg(INDUS) FILTER(where CHAS = 1.0) over()  avgCHAS_1
                        , avg(INDUS) FILTER(where CHAS = 0.0) over()  avgCHAS_0 
                FROM boston
                
                UNION ALL
                SELECT distinct 'NOX' as column_name
                        , avg(NOX) FILTER(where CHAS = 1.0) over()  avgCHAS_1
                        , avg(NOX) FILTER(where CHAS = 0.0) over()  avgCHAS_0 
                FROM boston
                )
    select * from tmp where avgCHAS_1>avgCHAS_0
    ''',
    con,
)

  column_name  avgCHAS_1  avgCHAS_0
0       INDUS  12.719143  11.019193
1         NOX   0.593426   0.551817

–í—ã–≤–æ–¥:
    –ö–æ–≥–¥–∞ –¥–æ–º –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π –∑–Ω–∞—á–µ–Ω–∏—è –≤—ã—à–µ –¥–ª—è —Å–ª–µ–¥—É—é—â–∏—Ö –ø–æ–∫–∞–∑–∞—Ç–µ–ª–µ–π:
             - –¥–æ–ª—è –∞–∫—Ä–æ–≤ –Ω–µ—Ç–æ—Ä–≥–æ–≤–æ–≥–æ –±–∏–∑–Ω–µ—Å–∞ –Ω–∞ –≥–æ—Ä–æ–¥;      
             - –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏—è –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞.        
             
–ò–∑ —á–µ–≥–æ –º–æ–∂–Ω–æ –ø—Ä–µ–¥–ø–æ–ª–æ–∂–∏—Ç—å, —á—Ç–æ –≤ —ç—Ç–∏—Ö —Ä–∞–π–æ–Ω–∞—Ö –±–æ–ª–µ–µ —Ä–∞—Å–ø—Ä–æ—Å—Ç—Ä–∞–Ω–µ–Ω–∞ –ø—Ä–æ–º—ã—à–ª–µ–Ω–Ω–æ—Å—Ç—å, —á–µ–º –≤ –Ω–µ –≥—Ä–∞–Ω–∏—á–∞—â–∏—Ö —Å —Ä–µ–∫–æ–π —Ä–∞–π–æ–Ω–∞—Ö.

8. –í—ã–≤–µ–¥–∏—Ç–µ –∑–Ω–∞—á–µ–Ω–∏—è –¥–æ–ª–µ–π –ø—Ä–æ–º—ã—à–ª–µ–Ω–Ω–æ–π –∑–∞—Å—Ç—Ä–æ–π–∫–∏(INDUS), –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏–∏ –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞(NOX) –∏ –ø–æ –∏—Ö –ø–µ—Ä—Ü–µ–Ω—Ç–∏–ª—è–º - 10, 20 ... 100 ( –ø–µ—Ä—Ü–µ—Ç–∏–ª—å(10,20...100),–∑–Ω–∞—á–µ–Ω–∏–µ INDUS, –∑–Ω–∞—á–µ–Ω–∏–µ NOX). –ù–∞–ø–∏—à–∏—Ç–µ –ø—Ä–æ—Å–ª–µ–∂–∏–≤–∞–µ—Ç—Å—è –º–µ–∂–¥—É –Ω–∏–º–∏ –≤–∑–∞–∏–º–æ—Å–≤—è–∑—å

In [34]:
tasks+=1
pd.read_sql(
    '''
     with 
       perc as ( 
         select column1 as Perc
         , round(cnt*column1) as idx
         FROM (VALUES (0.1), (0.2), (0.3), (0.4), (0.5), (0.6), (0.7), (0.8), (0.9), (1))
             join (select count(*) cnt from boston)
         )
      ,t_rating as (
        select INDUS, NOX, i.RowNumber from (
                    select INDUS, row_number() over(ORDER BY INDUS asc) as RowNumber
                    from boston) i
                join (
                    select NOX,row_number() over(ORDER BY NOX asc) as RowNumber
                    from boston) n 
                on n.RowNumber=i.RowNumber
                )
    select CAST(Perc*100 AS INT) Perc
          ,INDUS
          ,NOX
    from perc
        join t_rating on idx=RowNumber
    ''',
    con,
)

   Perc  INDUS    NOX
0    10   2.89  0.426
1    20   4.15  0.442
2    30   5.96  0.472
3    40   7.07  0.507
4    50   9.69  0.538
5    60  12.83  0.575
6    70  18.10  0.605
7    80  18.10  0.668
8    90  19.58  0.713
9   100  27.74  0.871

–û—Å–Ω–æ–≤—ã–≤–∞—è—Å—å –Ω–∞ –∑–Ω–∞—á–µ–Ω–∏—è—Ö –ø—Ä–æ—Ü–µ–Ω—Ç–∏–ª–µ–π —Å–ª–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –≤—ã–≤–æ–¥ –æ –∑–∞–≤–∏—Å–∏–º–æ—Å—Ç–∏ –ø–∞—Ä–∞–º–µ—Ç—Ä–æ–≤...

–ù–æ –µ—Å–ª–∏ –ø–æ—Å–º–æ—Ç—Ä–µ—Ç—å –Ω–∞ –∑–Ω–∞—á–µ–Ω–∏—è –¥–æ–ª–µ–π –ø—Ä–æ–º—ã—à–ª–µ–Ω–Ω–æ–π –∑–∞—Å—Ç—Ä–æ–π–∫–∏(INDUS) –∏ –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏–∏ –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞(NOX) –±–µ–∑ –ø—Ä–∏–≤—è–∑–∫–∏ –∫ –ø—Ä–æ—Ü–µ–Ω—Ç–∏–ª—è–º, —Ç–æ –≤ –ø—Ä–∏ —É–≤–µ–ª–∏—á–µ–Ω–∏–∏ INDUS –Ω–∞–±–ª—é–¥–∞–µ—Ç—Å—è —Ç–µ–Ω–¥–µ–Ω—Ü–∏—è –∫ —É–≤–µ–ª–∏—á–µ–Ω–∏—é NOX.

CRIM - —É—Ä–æ–≤–µ–Ω—å –ø—Ä–µ—Å—Ç—É–ø–Ω–æ—Å—Ç–∏ –Ω–∞ –¥—É—à—É –Ω–∞—Å–µ–ª–µ–Ω–∏—è
ZN - –¥–æ–ª—è –∑–µ–º–µ–ª—å –ø–æ–¥ –∂–∏–ª—É—é –∑–∞—Å—Ç—Ä–æ–π–∫—É –∑–æ–Ω–∏—Ä–æ–≤–∞–Ω–∞ –ø–æ–¥ —É—á–∞—Å—Ç–∫–∏ –ø–ª–æ—â–∞–¥—å—é –±–æ–ª–µ–µ 25 000 –∫–≤. —Ñ—É—Ç–æ–≤.
INDUS - –¥–æ–ª—è –∞–∫—Ä–æ–≤ –Ω–µ—Ç–æ—Ä–≥–æ–≤–æ–≥–æ –±–∏–∑–Ω–µ—Å–∞ –Ω–∞ –≥–æ—Ä–æ–¥.
CHAS - 1, –µ—Å–ª–∏ –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π, 0 –∏–Ω–∞—á–µ
NOX - –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏—è –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞ (—á–∞—Å—Ç–µ–π –Ω–∞ 10 –º–∏–ª–ª–∏–æ–Ω–æ–≤)
RM - —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∫–æ–º–Ω–∞—Ç –≤ –∫–≤–∞—Ä—Ç–∏—Ä–µ
AGE - –¥–æ–ª—è –∂–∏–ª—ã—Ö –¥–æ–º–æ–≤, –ø–æ—Å—Ç—Ä–æ–µ–Ω–Ω—ã—Ö –¥–æ 1940 –≥.
DIS - –≤–∑–≤–µ—à–µ–Ω–Ω—ã–µ —Ä–∞—Å—Å—Ç–æ—è–Ω–∏—è –¥–æ –ø—è—Ç–∏ —Ü–µ–Ω—Ç—Ä–æ–≤ –∑–∞–Ω—è—Ç–æ—Å—Ç–∏ –ë–æ—Å—Ç–æ–Ω–∞
RAD - –∏–Ω–¥–µ–∫—Å –¥–æ—Å—Ç—É–ø–Ω–æ—Å—Ç–∏ –∫ —Ä–∞–¥–∏–∞–ª—å–Ω—ã–º –º–∞–≥–∏—Å—Ç—Ä–∞–ª—è–º
TAX - –ø–æ–ª–Ω–∞—è —Å—Ç–∞–≤–∫–∞ –Ω–∞–ª–æ–≥–∞ –Ω–∞ –∏–º—É—â–µ—Å—Ç–≤–æ –∑–∞ 10 000 –¥–æ–ª–ª–∞—Ä–æ–≤ –°–®–ê
PTRATIO - —Å–æ–æ—Ç–Ω–æ—à–µ–Ω–∏–µ —É—á–µ–Ω–∏–∫–æ–≤ –∏ —É—á–∏—Ç–µ–ª–µ–π –ø–æ –≥–æ—Ä–æ–¥–∞–º
B - 1000(Bk - 0.63)^2, –≥–¥–µ Bk –¥–æ–ª—è —á–µ—Ä–Ω–æ–∫–æ–∂–∏—Ö –ª—é–¥–µ–π –ø–æ –≥–æ—Ä–æ–¥–∞–º
LSTAT - % –±–æ–ª–µ–µ –Ω–∏–∑–∫–æ–≥–æ —Å—Ç–∞—Ç—É—Å–∞ –Ω–∞—Å–µ–ª–µ–Ω–∏—è
MEDV - –°—Ä–µ–¥–Ω—è—è —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤ –≤ 1000 –¥–æ–ª–ª–∞—Ä–æ–≤.

In [37]:
if tasks==8:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ')
else:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –Ω–µ –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è! üôÄ')

–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ